/* Домашнє завдання №1: Виводимо в консоль будь що і пушим файли в ГітХаб

console.log('Привіт, JS');

*/

// Домашнє завдання №2: Вирішуємо завдання і описуємо як це працює

'number' + 23 + 32
Відповідь: 'number2332'
// Рядок присвоюється наступному елементу 'number23', далі він же присвоюється наступному числу 'number2332'

41 + 1 + 'number'
Відповідь: '42number'
// Спочатку спрацьовує додавання чисел, далі присвоюється рядок - '42number'

null + 1
Відповідь: 1
// null віддає порожнє поле, тобто 0, далі просто додається до числа 1

2 && 7
Відповідь: 7
// Так як всі операнди віддають значення true, отримуємо останнє значення 7

'10' - 5 === 6;
Відповідь:  false
// Рядок не може відняти сисло 5, тому віддає false. Далі false не може строго дорівнювати числу 6. Тому віддасть false

true + false
Відповідь: 1
// true віддасть 1, а false віддасть 0, просумуємо і отримуємо 1

'4px' - 3
Відповідь: NaN
// Таке віднімання є помилковим, то Not a Number

'4' - 3
Відповідь: 1
// Оператор - перетворює рядок в число. Віднімаємо.

'2' + 3 ** 2;
Відповідь:  '29'
// Число 3 зводимо до 2 ступня, даль рядок перетворює число 9, отримаємо рядок 29

12 / '6'
Відповідь: 2
// Оператор - перетворює рядок в число. Ділимо.

23 + 42 + 'number'
Відповідь: '65number'
// Спочатку спрацьовує додавання чисел, далі присвоюється рядок - '65number'

'10' + (5 === 6);
Відповідь: 10false
// 5 не дорівнює строго 6 і віддає false, рядок '10' перетворю false в рядок

'number' + 15 + 3
Відповідь: 'number153'
// Рядок присвоюється наступному елементу 'number15', далі він же присвоюється наступному числу 'number153'

undefined + 1;
Відповідь: NaN
// undefined - це невизначене значення, додавання до нього не дасть результату

'true' == true
Відповідь: false
// true віддасть 1, а рядок 'true' не дорівнює числу 1

false == 'false'
Відповідь: false
// false віддасть 0, а число 0 не дорівнює рядку 'false'

null == ''
Відповідь: false
// Строка не буде рівна null

3 ** (9 / 3);
Відповідь: 27
// 9 ділимо на 3. Перше число зводимо до 3 ступеню.

!!'false' == !!'true'
Відповідь: true
// Два знаки оклику передадуть операндам рядка true і вони дорівнюють один одному

0 || '0' && 1
Відповідь: 1
// Число 1 тут є єдиним правдивим значенням

1 < 2 < 3
Відповідь: true
// Все вірно - true

3 ** 2 / 3;
Відповідь: 3
// Число 3 зводимо до 2 ступеню, а потім ділим на 3

1 < 2 > 3
Відповідь: false
// Не вірно - false

false && true || true
Відповідь: true
// false && true віддасть true, далі виходіть true || true, яке віддасть перший true

false && (true || true);
Відповідь: false
// true || true дає true, далі обчислюється false && true, що віддає false, так як зупиняється і віддає значення операнда
